{
  "title": "2015",
  "template": "schedule",
  "location": "Dublin City University",
  "start": 9,
  "end": 13,
  "month": "March",
  "year": 2015,
  "live": "2015-03-09T12:00:00",
  "archive": "true",
  "video": "https://www.youtube.com/embed/videoseries?list=PLPaLJSHTDMFgYNnnEOjuvdm6WqOFTSQ9z",
  "days": [
    {
      "day": "Monday",
      "description": "Amazon",
      "events": [
        {
          "name": "Opening Event",
          "by": "Richard Walsh, Jeff Caselden, Rory O'Connor",
          "time": "12:00",
          "place": {
            "id": "The Mezz",
            "map": "Somewhere in DCU"
          },
          "description": "We will be opening #TechWeekDCU 2015 with an opening address from our Chairperson Richard Walsh, the General Manager of Amazon Data Services Ireland Ltd Jeff Caselden and the Head of the School of Computing in DCU Rory O' Connor. "
        },
        {
          "name": "Cloud Watching with AWS CloudWatch",
          "by": "John O'Shea - Amazon",
          "time": "12:15",
          "place": {
            "id": "The Mezz",
            "map": "Somewhere in DCU"
          },
          "description": "Amazon CloudWatch is a monitoring service for AWS cloud resources and the applications you run on AWS. You can use Amazon CloudWatch to collect and track metrics, collect and monitor log files, and set alarms.You can use Amazon CloudWatch to gain system-wide visibility into resource utilization, application performance, and operational health. You can use these insights to react and keep your application running smoothly. We'll have some Amazon Engineers taking us through how it works, and the importance that monitoring plays in Amazon-Scale computing."
        },
        {
          "name": "Talking Things: Internet of Things",
          "by": "Ronan Guilfoyle - Amazon",
          "time": "13:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Description to come."
        },
        {
          "name": "Lunch",
          "by": "Food",
          "time": "14:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Time for food to keep all the #TechWeekDCU enthusiasts going!"
        },
        {
          "name": "Project Workshops with Amazon SDEs",
          "by": "Amazon Engineers",
          "time": "15:00",
          "place": {
            "id": "LG26",
            "map": "DCU"
          },
          "description": "Amazon will be bringing in some of their very own SDE's who will be offering help to 3rd & 4th year students with their 3rd Year Projects and 4th Year Projects respectively. Come along for advice on anything from, optimisation, cloud deployment, website architecture, version control, frameworks. This will be a great time to get advice from people who are actually working in industry, and hopefully maximise your marks as a result."
        },
        {
          "name": "Managing the Pace of Innovation: Behind the Scenes at AWS",
          "by": "Colin Whittaker - grimnar@redbrick - Amazon",
          "time": "16:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "AWS launched in 2006, and since then we have released more than 1,000 services, features, and major announcements. Every year, AWS outpace the previous year in launches and are continuously accelerating the pace of innovation across the organization.\n Network Engineer at Amazon Dublin, long-time redbrick favourite, and holder of many patents Colin Whittaker returns again to share some Internet related knowledge. Colin has presented to redbrick many times over the years and is returning to share how teams in AWS are able to formulate customer-centric ideas, turn them into features and services, and get them to market quickly. This session dives deep into how an idea becomes a service at AWS and how we continue to evolve the service after release through innovation at every level. We will then walk through some real-world examples of how we applied these concepts to launch a new AWS service. Come learn about the rapid pace of innovation at AWS, and the culture that formulates magic behind the scenes."
        },
        {
          "name": "Networking",
          "by": "Redbrick & Amazon",
          "time": "17:00",
          "place": {
            "id": "NuBar",
            "map": "DCU"
          },
          "description": "We'll be having a networking session where you'll get to chat to the amazon engineers and recruitment team about jobs, life at amazon and some of the cool projects they're working on."
        }
      ]
    },
    {
      "day": "Tuesday",
      "description": "RB & Intercom",
      "events": [
        {
          "name": "The Anatomy of a 'Medium Data' Tech Company",
          "by": "Charlie von Metzradt - Hosted Graphite -phaxx@redbrick",
          "time": "13:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "No description available."
        },
        {
          "name": "Admin Tales of Fail",
          "by": "Rob Devereux, Lorcan Boyle, Richard Walsh : kylar, zergless, koffee @redbrick",
          "time": "14:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "How Redbrick was broken, and everything that admins both past and present did to fix it."
        },
        {
          "name": "Hacking Radio",
          "by": "Conor Farrell - lithium@redbrick",
          "time": "15:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "We're all familiar with listening to music on our favourite radio station, but did you know you can grab radio signals from aircraft and make your own desktop radar system? Or that you can turn a Raspberry Pi into a transmitter with a little bit of code? Conor Farrell will demonstrate and explain some radio hacks to give you some cool ideas for your own projects."
        },
        {
          "name": "How We Build Software at Intercom",
          "by": "Gavin Joyce - Intercom",
          "time": "16:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Shipping software is the heartbeat of Intercom. In this talk, we'll describe how our simple set of core values shape how we ship new Intercom features and how we continuously seek to raise our own engineering bar."
        },
        {
          "name": "How We Built Our In-App Messenger",
          "by": "Eoin Hennessy - Intercom",
          "time": "16:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Intercom is used by thousands of web and mobile businesses to talk to their customers. One of the ways in which you can talk to your customers is via our in-app messenger. A few months ago we set about building the next version of our in-app messenger for the web. We’ll talk about the challenges we encountered while building a client-side Javascript application built to run inside thousands of our customers sites."
        }
      ]
    },
    {
      "day": "Wednesday",
      "description": "Openet & Symantec",
      "events": [
        {
          "name": "Billion Dollar Botnets",
          "by": "Cathal Mullaney - nemo@redbrick - Symantec",
          "time": "13:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "One of the main motivations behind malware is revenue generation. Depending on the variant of the malware this can be accomplished in a number of different ways including sending spam emails, theft of personal information and extortion. When this type of malware is coupled with a distributed network of infected devices the revenue accumulated can quickly add up to millions of dollars. In this presentation we examine a piece of malware designed exclusively for mobile phones that formed part of a Billion Dollar, Mobile, Botnet."
        },
        {
          "name": "Cybercrime, espionage and sabotage:A look at the threat landscape for 2014",
          "by": "Alan Neville - anev@redbrick - Symantec",
          "time": "14:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Malware continuies to menace computer networks around the world - from home users to enterprise. As cybercrimninals and nation states behind these attacks use mixed approaches and advanced malware to routinely by-pass traditional security defenses, security experts need to look ahead and attempt to predict the evolution of threats to better protect their customers. We take a look over the past year and highlight the trends in attacks and assoicated malware used in sabotage."
        },
        {
          "name": "IRC Bots - Useful Utilities, Entertainment, and Insults!",
          "by": "Craig Gavagan Mac Entee - creadak@redbrick",
          "time": "14:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": " Internet Relay Chat is a nice way to communicate with other Redbrick members, but did you know there are also programs to provide Dublin bus info, play card games, and even get a randomised insult for laughs, all from your IRC client? Craig will take us through some live examples of these bots and hopefully kickstart some ideas for new ones."
        },
        {
          "name": "Openet",
          "by": "Openet",
          "time": "15:30",
          "place": {
            "id": "L101",
            "map": "DCU"
          },
          "description": "Openet are Irelands largest indigenous software company. They provide software to telecommunications service providers to commercialize and analyze activity on their networks."
        },
        {
          "name": "Coding Competition",
          "by": "Openet",
          "time": "16:00",
          "place": {
            "id": "L101",
            "map": "DCU"
          },
          "description": "Open to all registered students of DCU. Openet will be running their annual coding competition. With cash prizes as well as the opportunity to prove yourself to a company that hire a lot of DCU graduates, this competition is not one to be missed. Not only will there be prizes for 1st place and runners up, there will be some other ones in there too. It's all about partiipation. Prove your skills http://openetcash4code.com/ ."
        },
        {
          "name": "Networking & Food",
          "by": "Redbrick & Openet",
          "time": "17:30",
          "place": {
            "id": "NuBar",
            "map": "DCU"
          },
          "description": "Lets go to the NuBar for some food and networking with the guys from Openet."
        },
        {
          "name": "Prizegiving",
          "by": "Openet",
          "time": "18:30",
          "place": {
            "id": "NuBar",
            "map": "DCU"
          },
          "description": "Openet will be presenting us with their prizes for the competition."
        }
      ]
    },
    {
      "day": "Thursday",
      "description": "Google",
      "events": [
        {
          "name": "Building Reliable Large-Scale Distributed Systems",
          "by": "Laura Nolan - Google",
          "time": "13:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Exactly what it says on the tin. Google opperates at a massive scale and this brings with it some interesting and difficult challenges. Come listen to some engineers from Google walk us through as How-To of sorts on building Systems that operate at Google-Scale. "
        },
        {
          "name": "Lunch",
          "by": "Food",
          "time": "14:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Time again for some food to keep all the #TechWeekDCU enthusiasts going!"
        },
        {
          "name": "Internet of Things",
          "by": "Tommie Gannert - Google",
          "time": "14:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Details to follow.."
        },
        {
          "name": "Linear Algebra",
          "by": "Magnus Deininger - Google",
          "time": "15:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Linear Algebra is at the heart of everything that we do in computing. Come and hear a unique take on this subject from some Google Engineers who push it to the limit on a daily basis in order to make the worlds information universally accessible."
        },
        {
          "name": "Expecting the Unexpected",
          "by": "Gareth Eason - Google",
          "time": "16:30",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "One of our most anticipated talks of #TechWeekDCU 2015. Engineers from Google will be talking to us about their culture of expecting the unexpected. They'll be speaking about DiRT (Disater Recovery Training), a mix of roleplay and systems/network operations and design/infrastructure testing in a contriolled environment, which enables them to respond fast in the face of unexpected problems at scale."
        },
        {
          "name": "Close Networking Session",
          "by": "Redbrick & Google",
          "time": "17:30",
          "place": {
            "id": "NuBar",
            "map": "DCU"
          },
          "description": "We'll have a networking session where you'll get to talk to the guys from Google about anything and everything that their NDA's will allow."
        }
      ]
    },
    {
      "day": "Friday",
      "description": "AOL",
      "events": [
        {
          "name": "The Architecture of Online Ad Delivery",
          "by": "Ken Wilson - AOL",
          "time": "12:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Ad Delivery technology provides software to web sites and advertisers to serve ads, count them, choose the ads that will make the website or advertiser most money, and monitor progress of different advertising campaigns or Real-time auctions. "
        },
        {
          "name": "Introduction to Erlang in the context of a Real Time Advertising Auction",
          "by": "Philip Clarke - AOL",
          "time": "13:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Live coding to show the basics of recursing, pattern matching, message passing and concurrency in Erlang. Demonstrate a how to write an advertising exchange where a seller (SSP) and a buyer (DSP) interact via an auction. We can then spawn multiple exchanges which talk to multiple DSPs and show many thousands of these auctions running concurrently."
        },
        {
          "name": "Introduction to Microserver - Aol's new open source project that makes creating Rest webservices in Java easy and fun! ",
          "by": "John McClean - AOL",
          "time": "14:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "Introduction to Microserver - Aol's new open source project that makes creating Rest webservices in Java easy and fun! "
        },
        {
          "name": "Clean Code - Join the Revolution!",
          "by": "Michael Pierce - AOL",
          "time": "15:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "What is Clean Code? An introduction to coding practices at AOL. For a programmer, writing clean code is a must to ensure that it is maintainable, easy to follow and you can understand its intent. "
        },
        {
          "name": "Continuous Integration/Continuous Deployment (CI/CD)",
          "by": "Jose Martinez - AOL",
          "time": "16:00",
          "place": {
            "id": "The Mezz",
            "map": "DCU"
          },
          "description": "From your command line to production environment just hitting a key. How can this be achieved? A brief introduction to CI/CD, some tools and an example on how this could be done promoting your package from one environment to the other until it reaches production. Tools: git, maven, Jenkins and shell script."
        }
      ]
    }
  ]
}
